# pandas.DataFrame Basics

## 1.Creating Data Frame

### Creating a data frame using list

In [56]:
import pandas as pd
import numpy as np
data = [['Apple', 5],['Orange',8]]
df1 = pd.DataFrame(data, columns = ['Item','Number'],index=['first item','second item'])
print (df1)

               Item  Number
first item    Apple       5
second item  Orange       8

### Creating a data frame using dict of list

In [57]:
data1 = {'Item': ['Apple','Orange'],'Number': [5 , 8]}
df2 = pd.DataFrame(data1, index=['item 1','item 2'])
print (df2)

          Item  Number
item 1   Apple       5
item 2  Orange       8

### Creating a data frame using list of dict

In [58]:
data2 = [{'Item': 'Apple','Number': 8},{'Item':'Orange','Number':5}]
df3 = pd.DataFrame(data2,index=['i1','i2'])
print (df3)

      Item  Number
i1   Apple       8
i2  Orange       5

### Creating a data frame using a dict of series

In [59]:
data3 = {'Item':pd.Series(['Apple','Orange'],index = ['i1','i2']), 'Number':pd.Series([6, 8],index = ['i1','i2'])}
df4 = pd.DataFrame(data3)
print(df4)

      Item  Number
i1   Apple       6
i2  Orange       8

## 2. Column Selection, Addition and Deletion^

### Selection

In [60]:
df4['Item']

i1     Apple
i2    Orange
Name: Item, dtype: object

### Addition

In [61]:
df4['Store'] = pd.Series(['Coles','Coles'], index = ['i1','i2'])
df4

      Item  Number  Store
i1   Apple       6  Coles
i2  Orange       8  Coles

### Deletion

In [62]:
df3.pop('Number')
df3

      Item
i1   Apple
i2  Orange

In [63]:
del df2['Item']
df2

        Number
item 1       5
item 2       8

## 3. Row selection, addition and deletion

### Selection

In [64]:
df4.loc['i1']

Item      Apple
Number        6
Store     Coles
Name: i1, dtype: object

In [65]:
df4.iloc[0]

Item      Apple
Number        6
Store     Coles
Name: i1, dtype: object

In [66]:
df4[:2]

      Item  Number  Store
i1   Apple       6  Coles
i2  Orange       8  Coles

### Addtion

In [67]:
df_add = pd.DataFrame({'Item': ['Tomata','Cucumber'],'Number': [9, 12],'Store': ['Woolworth','Aldi']},index = ['i3','i4'])
df4 = df4.append(df_add)
df4

        Item  Number      Store
i1     Apple       6      Coles
i2    Orange       8      Coles
i3    Tomata       9  Woolworth
i4  Cucumber      12       Aldi

### Deletion

In [68]:
df4 = df4.drop('i4')

In [69]:
df4

      Item  Number      Store
i1   Apple       6      Coles
i2  Orange       8      Coles
i3  Tomata       9  Woolworth